espressif/arduino-esp32/boards.txt
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

aksu.name=Ticos Kit Aksu

aksu.upload.tool=esptool_py
aksu.upload.tool.default=esptool_py
aksu.upload.maximum_size=1310720
aksu.upload.maximum_data_size=327680
aksu.upload.flags=
aksu.upload.extra_flags=

aksu.serial.disableDTR=true
aksu.serial.disableRTS=true

aksu.build.tarch=xtensa
aksu.build.bootloader_addr=0x1000
aksu.build.target=esp32
aksu.build.mcu=esp32
aksu.build.core=esp32
aksu.build.variant=aksu
aksu.build.board=aksu
aksu.build.f_cpu=240000000L
aksu.build.boot=dio
aksu.build.partitions=minimal
aksu.build.flash_mode=dio
aksu.build.flash_size=4MB
aksu.build.flash_freq=40m
aksu.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw

aksu.menu.UploadSpeed.921600=921600
aksu.menu.UploadSpeed.921600.upload.speed=921600
aksu.menu.UploadSpeed.115200=115200
aksu.menu.UploadSpeed.115200.upload.speed=115200
aksu.menu.UploadSpeed.256000.windows=256000
aksu.menu.UploadSpeed.256000.upload.speed=256000
aksu.menu.UploadSpeed.230400.windows.upload.speed=256000
aksu.menu.UploadSpeed.230400=230400
aksu.menu.UploadSpeed.230400.upload.speed=230400
aksu.menu.UploadSpeed.460800.linux=460800
aksu.menu.UploadSpeed.460800.macosx=460800
aksu.menu.UploadSpeed.460800.upload.speed=460800
aksu.menu.UploadSpeed.512000.windows=512000
aksu.menu.UploadSpeed.512000.upload.speed=512000

aksu.menu.DebugLevel.none=None
aksu.menu.DebugLevel.none.build.code_debug=0
aksu.menu.DebugLevel.error=Error
aksu.menu.DebugLevel.error.build.code_debug=1
aksu.menu.DebugLevel.warn=Warn
aksu.menu.DebugLevel.warn.build.code_debug=2
aksu.menu.DebugLevel.info=Info
aksu.menu.DebugLevel.info.build.code_debug=3
aksu.menu.DebugLevel.debug=Debug
aksu.menu.DebugLevel.debug.build.code_debug=4
aksu.menu.DebugLevel.verbose=Verbose
aksu.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

redfuji.name=Ticos Kit Red Fuji
redfuji.vid.0=0x303a
redfuji.pid.0=0x1001

redfuji.bootloader.tool=esptool_py
redfuji.bootloader.tool.default=esptool_py
redfuji.upload.tool=esptool_py
redfuji.upload.tool.default=esptool_py
redfuji.upload.tool.network=esp_ota
redfuji.upload.maximum_size=1310720
redfuji.upload.maximum_data_size=327680
redfuji.upload.flags=
redfuji.upload.extra_flags=
redfuji.upload.use_1200bps_touch=false
redfuji.upload.wait_for_upload_port=false

redfuji.serial.disableDTR=false
redfuji.serial.disableRTS=false

redfuji.build.tarch=xtensa
redfuji.build.bootloader_addr=0x0
redfuji.build.target=esp32s3
redfuji.build.mcu=esp32s3
redfuji.build.core=esp32
redfuji.build.variant=redfuji
redfuji.build.board=redfuji

redfuji.build.usb_mode=1
redfuji.build.cdc_on_boot=1
redfuji.build.msc_on_boot=0
redfuji.build.dfu_on_boot=0
redfuji.build.f_cpu=240000000L
redfuji.build.flash_size=4MB
redfuji.build.flash_freq=80m
redfuji.build.flash_mode=dio
redfuji.build.boot=qio
redfuji.build.boot_freq=80m
redfuji.build.partitions=default
redfuji.build.defines=
redfuji.build.loop_core=
redfuji.build.event_core=

redfuji.menu.LoopCore.1=Core 1
redfuji.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
redfuji.menu.LoopCore.0=Core 0
redfuji.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

redfuji.menu.EventsCore.1=Core 1
redfuji.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
redfuji.menu.EventsCore.0=Core 0
redfuji.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

redfuji.menu.USBMode.hwcdc=Hardware CDC and JTAG
redfuji.menu.USBMode.hwcdc.build.usb_mode=1
redfuji.menu.USBMode.default=USB-OTG
redfuji.menu.USBMode.default.build.usb_mode=0

redfuji.menu.CDCOnBoot.default=Disabled
redfuji.menu.CDCOnBoot.default.build.cdc_on_boot=0
redfuji.menu.CDCOnBoot.cdc=Enabled
redfuji.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

redfuji.menu.MSCOnBoot.default=Disabled
redfuji.menu.MSCOnBoot.default.build.msc_on_boot=0
redfuji.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
redfuji.menu.MSCOnBoot.msc.build.msc_on_boot=1

redfuji.menu.DFUOnBoot.default=Disabled
redfuji.menu.DFUOnBoot.default.build.dfu_on_boot=0
redfuji.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
redfuji.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

redfuji.menu.UploadMode.default=UART0
redfuji.menu.UploadMode.default.upload.use_1200bps_touch=false
redfuji.menu.UploadMode.default.upload.wait_for_upload_port=false
redfuji.menu.UploadMode.cdc=Internal USB
redfuji.menu.UploadMode.cdc.upload.use_1200bps_touch=true
redfuji.menu.UploadMode.cdc.upload.wait_for_upload_port=true
redfuji.menu.PSRAM.disabled=Disabled
redfuji.menu.PSRAM.disabled.build.defines=
redfuji.menu.PSRAM.enabled=Enabled
redfuji.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

redfuji.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
redfuji.menu.PartitionScheme.default.build.partitions=default
redfuji.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
redfuji.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
redfuji.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
redfuji.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
redfuji.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
redfuji.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
redfuji.menu.PartitionScheme.minimal.build.partitions=minimal
redfuji.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
redfuji.menu.PartitionScheme.no_ota.build.partitions=no_ota
redfuji.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
redfuji.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
redfuji.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
redfuji.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
redfuji.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
redfuji.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
redfuji.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
redfuji.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
redfuji.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
redfuji.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
redfuji.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
redfuji.menu.PartitionScheme.huge_app.build.partitions=huge_app
redfuji.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
redfuji.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
redfuji.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
redfuji.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
redfuji.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
redfuji.menu.PartitionScheme.fatflash.build.partitions=ffat
redfuji.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
redfuji.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
redfuji.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
redfuji.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

redfuji.menu.CPUFreq.240=240MHz (WiFi)
redfuji.menu.CPUFreq.240.build.f_cpu=240000000L
redfuji.menu.CPUFreq.160=160MHz (WiFi)
redfuji.menu.CPUFreq.160.build.f_cpu=160000000L
redfuji.menu.CPUFreq.80=80MHz (WiFi)
redfuji.menu.CPUFreq.80.build.f_cpu=80000000L
redfuji.menu.CPUFreq.40=40MHz
redfuji.menu.CPUFreq.40.build.f_cpu=40000000L
redfuji.menu.CPUFreq.20=20MHz
redfuji.menu.CPUFreq.20.build.f_cpu=20000000L
redfuji.menu.CPUFreq.10=10MHz
redfuji.menu.CPUFreq.10.build.f_cpu=10000000L

redfuji.menu.FlashMode.qio=QIO
redfuji.menu.FlashMode.qio.build.flash_mode=dio
redfuji.menu.FlashMode.qio.build.boot=qio
redfuji.menu.FlashMode.dio=DIO
redfuji.menu.FlashMode.dio.build.flash_mode=dio
redfuji.menu.FlashMode.dio.build.boot=dio
redfuji.menu.FlashMode.qout=QOUT
redfuji.menu.FlashMode.qout.build.flash_mode=dout
redfuji.menu.FlashMode.qout.build.boot=qout
redfuji.menu.FlashMode.dout=DOUT
redfuji.menu.FlashMode.dout.build.flash_mode=dout
redfuji.menu.FlashMode.dout.build.boot=dout

