espressif/arduino-esp32/boards.txt
redfuji.menu.FlashFreq.80=80MHz
redfuji.menu.FlashFreq.80.build.flash_freq=80m
redfuji.menu.FlashFreq.40=40MHz
redfuji.menu.FlashFreq.40.build.flash_freq=40m

redfuji.menu.FlashSize.4M=4MB (32Mb)
redfuji.menu.FlashSize.4M.build.flash_size=4MB
redfuji.menu.FlashSize.8M=8MB (64Mb)
redfuji.menu.FlashSize.8M.build.flash_size=8MB
redfuji.menu.FlashSize.8M.build.partitions=default_8MB
redfuji.menu.FlashSize.2M=2MB (16Mb)
redfuji.menu.FlashSize.2M.build.flash_size=2MB
redfuji.menu.FlashSize.2M.build.partitions=minimal
redfuji.menu.FlashSize.16M=16MB (128Mb)
redfuji.menu.FlashSize.16M.build.flash_size=16MB
redfuji.menu.UploadSpeed.921600=921600
redfuji.menu.UploadSpeed.921600.upload.speed=921600
redfuji.menu.UploadSpeed.115200=115200
redfuji.menu.UploadSpeed.115200.upload.speed=115200
redfuji.menu.UploadSpeed.256000.windows=256000
redfuji.menu.UploadSpeed.256000.upload.speed=256000
redfuji.menu.UploadSpeed.230400.windows.upload.speed=256000
redfuji.menu.UploadSpeed.230400=230400
redfuji.menu.UploadSpeed.230400.upload.speed=230400
redfuji.menu.UploadSpeed.460800.linux=460800
redfuji.menu.UploadSpeed.460800.macosx=460800
redfuji.menu.UploadSpeed.460800.upload.speed=460800
redfuji.menu.UploadSpeed.512000.windows=512000
redfuji.menu.UploadSpeed.512000.upload.speed=512000

redfuji.menu.DebugLevel.none=None
redfuji.menu.DebugLevel.none.build.code_debug=0
redfuji.menu.DebugLevel.error=Error
redfuji.menu.DebugLevel.error.build.code_debug=1
redfuji.menu.DebugLevel.warn=Warn
redfuji.menu.DebugLevel.warn.build.code_debug=2
redfuji.menu.DebugLevel.info=Info
redfuji.menu.DebugLevel.info.build.code_debug=3
redfuji.menu.DebugLevel.debug=Debug
redfuji.menu.DebugLevel.debug.build.code_debug=4
redfuji.menu.DebugLevel.verbose=Verbose
redfuji.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

gala.name=Ticos Kit Gala
gala.vid.0=0x303a
gala.pid.0=0x1001

gala.bootloader.tool=esptool_py
gala.bootloader.tool.default=esptool_py
gala.upload.tool=esptool_py
gala.upload.tool.default=esptool_py
gala.upload.tool.network=esp_ota
gala.upload.maximum_size=1310720
gala.upload.maximum_data_size=327680
gala.upload.flags=
gala.upload.extra_flags=
gala.upload.use_1200bps_touch=false
gala.upload.wait_for_upload_port=false

gala.serial.disableDTR=false
gala.serial.disableRTS=false

gala.build.tarch=xtensa
gala.build.bootloader_addr=0x0
gala.build.target=esp32s3
gala.build.mcu=esp32s3
gala.build.core=esp32
gala.build.variant=gala
gala.build.board=gala

gala.build.usb_mode=1
gala.build.cdc_on_boot=1
gala.build.msc_on_boot=0
gala.build.dfu_on_boot=0
gala.build.f_cpu=240000000L
gala.build.flash_size=4MB
gala.build.flash_freq=80m
gala.build.flash_mode=dio
gala.build.boot=qio
gala.build.boot_freq=80m
gala.build.partitions=default
gala.build.defines=
gala.build.loop_core=
gala.build.event_core=

gala.menu.LoopCore.1=Core 1
gala.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
gala.menu.LoopCore.0=Core 0
gala.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

gala.menu.EventsCore.1=Core 1
gala.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
gala.menu.EventsCore.0=Core 0
gala.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

gala.menu.USBMode.hwcdc=Hardware CDC and JTAG
gala.menu.USBMode.hwcdc.build.usb_mode=1
gala.menu.USBMode.default=USB-OTG
gala.menu.USBMode.default.build.usb_mode=0

gala.menu.CDCOnBoot.default=Disabled
gala.menu.CDCOnBoot.default.build.cdc_on_boot=0
gala.menu.CDCOnBoot.cdc=Enabled
gala.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

gala.menu.MSCOnBoot.default=Disabled
gala.menu.MSCOnBoot.default.build.msc_on_boot=0
gala.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
gala.menu.MSCOnBoot.msc.build.msc_on_boot=1

gala.menu.DFUOnBoot.default=Disabled
gala.menu.DFUOnBoot.default.build.dfu_on_boot=0
gala.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
gala.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

gala.menu.UploadMode.default=UART0
gala.menu.UploadMode.default.upload.use_1200bps_touch=false
gala.menu.UploadMode.default.upload.wait_for_upload_port=false
gala.menu.UploadMode.cdc=Internal USB
gala.menu.UploadMode.cdc.upload.use_1200bps_touch=true
gala.menu.UploadMode.cdc.upload.wait_for_upload_port=true
gala.menu.PSRAM.disabled=Disabled
gala.menu.PSRAM.disabled.build.defines=
gala.menu.PSRAM.enabled=Enabled
gala.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

gala.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
gala.menu.PartitionScheme.default.build.partitions=default
gala.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
gala.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
gala.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
gala.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
gala.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
gala.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
gala.menu.PartitionScheme.minimal.build.partitions=minimal
gala.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
gala.menu.PartitionScheme.no_ota.build.partitions=no_ota
gala.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
gala.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
gala.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
gala.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
gala.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
gala.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
gala.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
gala.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
gala.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
gala.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
gala.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
gala.menu.PartitionScheme.huge_app.build.partitions=huge_app
gala.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
gala.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
gala.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
gala.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
gala.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
gala.menu.PartitionScheme.fatflash.build.partitions=ffat
gala.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
gala.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
gala.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
gala.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

gala.menu.CPUFreq.240=240MHz (WiFi)
gala.menu.CPUFreq.240.build.f_cpu=240000000L
gala.menu.CPUFreq.160=160MHz (WiFi)
gala.menu.CPUFreq.160.build.f_cpu=160000000L
gala.menu.CPUFreq.80=80MHz (WiFi)
gala.menu.CPUFreq.80.build.f_cpu=80000000L
gala.menu.CPUFreq.40=40MHz
gala.menu.CPUFreq.40.build.f_cpu=40000000L
gala.menu.CPUFreq.20=20MHz
gala.menu.CPUFreq.20.build.f_cpu=20000000L
gala.menu.CPUFreq.10=10MHz
gala.menu.CPUFreq.10.build.f_cpu=10000000L

gala.menu.FlashMode.qio=QIO
gala.menu.FlashMode.qio.build.flash_mode=dio
gala.menu.FlashMode.qio.build.boot=qio
gala.menu.FlashMode.dio=DIO
gala.menu.FlashMode.dio.build.flash_mode=dio
gala.menu.FlashMode.dio.build.boot=dio
gala.menu.FlashMode.qout=QOUT
gala.menu.FlashMode.qout.build.flash_mode=dout
gala.menu.FlashMode.qout.build.boot=qout
gala.menu.FlashMode.dout=DOUT
gala.menu.FlashMode.dout.build.flash_mode=dout
gala.menu.FlashMode.dout.build.boot=dout

gala.menu.FlashFreq.80=80MHz
gala.menu.FlashFreq.80.build.flash_freq=80m
gala.menu.FlashFreq.40=40MHz
gala.menu.FlashFreq.40.build.flash_freq=40m

gala.menu.FlashSize.4M=4MB (32Mb)
gala.menu.FlashSize.4M.build.flash_size=4MB
gala.menu.FlashSize.8M=8MB (64Mb)
gala.menu.FlashSize.8M.build.flash_size=8MB
gala.menu.FlashSize.8M.build.partitions=default_8MB
gala.menu.FlashSize.2M=2MB (16Mb)
gala.menu.FlashSize.2M.build.flash_size=2MB
gala.menu.FlashSize.2M.build.partitions=minimal
gala.menu.FlashSize.16M=16MB (128Mb)
gala.menu.FlashSize.16M.build.flash_size=16MB
gala.menu.UploadSpeed.921600=921600
gala.menu.UploadSpeed.921600.upload.speed=921600
gala.menu.UploadSpeed.115200=115200
gala.menu.UploadSpeed.115200.upload.speed=115200
gala.menu.UploadSpeed.256000.windows=256000
gala.menu.UploadSpeed.256000.upload.speed=256000
gala.menu.UploadSpeed.230400.windows.upload.speed=256000
gala.menu.UploadSpeed.230400=230400
gala.menu.UploadSpeed.230400.upload.speed=230400
gala.menu.UploadSpeed.460800.linux=460800
gala.menu.UploadSpeed.460800.macosx=460800
gala.menu.UploadSpeed.460800.upload.speed=460800
gala.menu.UploadSpeed.512000.windows=512000
gala.menu.UploadSpeed.512000.upload.speed=512000

gala.menu.DebugLevel.none=None
gala.menu.DebugLevel.none.build.code_debug=0
gala.menu.DebugLevel.error=Error
gala.menu.DebugLevel.error.build.code_debug=1
gala.menu.DebugLevel.warn=Warn
gala.menu.DebugLevel.warn.build.code_debug=2
gala.menu.DebugLevel.info=Info
gala.menu.DebugLevel.info.build.code_debug=3
gala.menu.DebugLevel.debug=Debug
gala.menu.DebugLevel.debug.build.code_debug=4
gala.menu.DebugLevel.verbose=Verbose
gala.menu.DebugLevel.verbose.build.code_debug=5

