espressif/arduino-esp32/boards.txt
##############################################################

pinova.name=Ticos Kit Pinova
pinova.vid.0=0x303a
pinova.pid.0=0x1001

pinova.bootloader.tool=esptool_py
pinova.bootloader.tool.default=esptool_py

pinova.upload.tool=esptool_py
pinova.upload.tool.default=esptool_py
pinova.upload.tool.network=esp_ota

pinova.upload.maximum_size=1310720
pinova.upload.maximum_data_size=327680
pinova.upload.flags=
pinova.upload.extra_flags=
pinova.upload.use_1200bps_touch=false
pinova.upload.wait_for_upload_port=false

pinova.serial.disableDTR=false
pinova.serial.disableRTS=false

pinova.build.tarch=riscv32
pinova.build.target=esp
pinova.build.mcu=esp32c3
pinova.build.core=esp32
pinova.build.variant=pinova
pinova.build.board=pinova
pinova.build.bootloader_addr=0x0

pinova.build.cdc_on_boot=0
pinova.build.f_cpu=160000000L
pinova.build.flash_size=4MB
pinova.build.flash_freq=80m
pinova.build.flash_mode=qio
pinova.build.boot=qio
pinova.build.partitions=default
pinova.build.defines=

pinova.menu.CDCOnBoot.default=Disabled
pinova.menu.CDCOnBoot.default.build.cdc_on_boot=0
pinova.menu.CDCOnBoot.cdc=Enabled
pinova.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

pinova.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
pinova.menu.PartitionScheme.default.build.partitions=default
pinova.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
pinova.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
pinova.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
pinova.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
pinova.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
pinova.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
pinova.menu.PartitionScheme.minimal.build.partitions=minimal
pinova.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
pinova.menu.PartitionScheme.no_ota.build.partitions=no_ota
pinova.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
pinova.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
pinova.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
pinova.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
pinova.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
pinova.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
pinova.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
pinova.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
pinova.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
pinova.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
pinova.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
pinova.menu.PartitionScheme.huge_app.build.partitions=huge_app
pinova.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
pinova.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
pinova.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
pinova.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
pinova.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
pinova.menu.PartitionScheme.fatflash.build.partitions=ffat
pinova.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
pinova.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
pinova.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
pinova.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

pinova.menu.CPUFreq.160=160MHz (WiFi)
pinova.menu.CPUFreq.160.build.f_cpu=160000000L
pinova.menu.CPUFreq.80=80MHz (WiFi)
pinova.menu.CPUFreq.80.build.f_cpu=80000000L
pinova.menu.CPUFreq.40=40MHz
pinova.menu.CPUFreq.40.build.f_cpu=40000000L
pinova.menu.CPUFreq.20=20MHz
pinova.menu.CPUFreq.20.build.f_cpu=20000000L
pinova.menu.CPUFreq.10=10MHz
pinova.menu.CPUFreq.10.build.f_cpu=10000000L

pinova.menu.FlashMode.qio=QIO
pinova.menu.FlashMode.qio.build.flash_mode=dio
pinova.menu.FlashMode.qio.build.boot=qio
pinova.menu.FlashMode.dio=DIO
pinova.menu.FlashMode.dio.build.flash_mode=dio
pinova.menu.FlashMode.dio.build.boot=dio
pinova.menu.FlashMode.qout=QOUT
pinova.menu.FlashMode.qout.build.flash_mode=dout
pinova.menu.FlashMode.qout.build.boot=qout
pinova.menu.FlashMode.dout=DOUT
pinova.menu.FlashMode.dout.build.flash_mode=dout
pinova.menu.FlashMode.dout.build.boot=dout

pinova.menu.FlashFreq.80=80MHz
pinova.menu.FlashFreq.80.build.flash_freq=80m
pinova.menu.FlashFreq.40=40MHz
pinova.menu.FlashFreq.40.build.flash_freq=40m

pinova.menu.FlashSize.4M=4MB (32Mb)
pinova.menu.FlashSize.4M.build.flash_size=4MB
pinova.menu.FlashSize.8M=8MB (64Mb)
pinova.menu.FlashSize.8M.build.flash_size=8MB
pinova.menu.FlashSize.8M.build.partitions=default_8MB
pinova.menu.FlashSize.2M=2MB (16Mb)
pinova.menu.FlashSize.2M.build.flash_size=2MB
pinova.menu.FlashSize.2M.build.partitions=minimal
pinova.menu.FlashSize.16M=16MB (128Mb)
pinova.menu.FlashSize.16M.build.flash_size=16MB

pinova.menu.UploadSpeed.921600=921600
pinova.menu.UploadSpeed.921600.upload.speed=921600
pinova.menu.UploadSpeed.115200=115200
pinova.menu.UploadSpeed.115200.upload.speed=115200
pinova.menu.UploadSpeed.256000.windows=256000
pinova.menu.UploadSpeed.256000.upload.speed=256000
pinova.menu.UploadSpeed.230400.windows.upload.speed=256000
pinova.menu.UploadSpeed.230400=230400
pinova.menu.UploadSpeed.230400.upload.speed=230400
pinova.menu.UploadSpeed.460800.linux=460800
pinova.menu.UploadSpeed.460800.macosx=460800
pinova.menu.UploadSpeed.460800.upload.speed=460800
pinova.menu.UploadSpeed.512000.windows=512000
pinova.menu.UploadSpeed.512000.upload.speed=512000

pinova.menu.DebugLevel.none=None
pinova.menu.DebugLevel.none.build.code_debug=0
pinova.menu.DebugLevel.error=Error
pinova.menu.DebugLevel.error.build.code_debug=1
pinova.menu.DebugLevel.warn=Warn
pinova.menu.DebugLevel.warn.build.code_debug=2
pinova.menu.DebugLevel.info=Info
pinova.menu.DebugLevel.info.build.code_debug=3
pinova.menu.DebugLevel.debug=Debug
pinova.menu.DebugLevel.debug.build.code_debug=4
pinova.menu.DebugLevel.verbose=Verbose
pinova.menu.DebugLevel.verbose.build.code_debug=5

##############################################################